<?php
function setFriendly($friendly)
{
    $caracteres = array("á" => "a", "é" => "e", "í­" => "i", "ó" => "o", "ú" => "u", "ñ" => "n",
        "Á" => "A", "É" => "E", "Í" => "I", "Ó" => "O", "Ú" => "U", "Ñ" => "N", "´"=>"",
        " " => "-", "&" => "", "%" => "", "$" => "", "#" => "", "?" => "", "!" => "",
        "¡" => "", "¿" => "", "@" => "", "\"" => "", "'" => "", "/" => "", "\\" => "",
        "~" => "-", "=" => "-", "{" => "", "}" => "", "[" => "", "]" => "", "°" => "",
        "+" => "-", "," => "-", "." => "-", "*" => "", "(" => "", ")" => "", ";" => "", ":" => "");

    foreach ($caracteres as $key => $value) {
        $friendly = str_replace($key, $value, $friendly);
    }
    $friendly = substr($friendly, 0, 50);
    return $friendly;
}
?>